tap "homebrew/bundle"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "keith/formulae"
tap "modularml/packages"
tap "mongodb/brew"
tap "nativeos/i386-elf-toolchain"
brew "xz"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "asio"
brew "assimp"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "binutils"
brew "bison"
brew "bochs"
brew "bookokrat"
brew "bullet"
brew "freetype"
brew "glib"
brew "eigen"
brew "gcc"
brew "glog"
brew "suite-sparse"
brew "pkgconf"
brew "hdf5"
brew "chrome-cli"
brew "clang-format"
brew "cmake", link: false
brew "freetds"
brew "webp"
brew "libavif"
brew "gd"
brew "icu4c@77", link: true
brew "libpq", link: true
brew "php"
brew "composer"
brew "console_bridge"
brew "tinyxml2"
brew "cppcheck"
brew "cunit"
brew "docker"
brew "docker-compose"
brew "doctl"
brew "ffmpeg"
brew "flac"
brew "harfbuzz"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg@6"
brew "fish"
brew "flex"
brew "fzf"
brew "gdown"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gperf"
brew "gperftools"
brew "graphviz"
brew "i386-elf-gdb"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "macvim"
brew "node"
brew "mongosh"
brew "zlib"
brew "mysql"
brew "nasm"
brew "neovim"
brew "netcdf"
brew "numpy", link: false
brew "openvino"
brew "vtk"
brew "opencv"
brew "openssl@1.1"
brew "pcre"
brew "perl"
brew "poppler"
brew "portaudio"
brew "postgresql@15"
brew "postgresql@16"
brew "postgresql@17", restart_service: :changed
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyqt"
brew "pyright", link: false
brew "python@3.11"
brew "python@3.8"
brew "pytorch"
brew "qemu"
brew "qt"
brew "qt@5"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "sfml"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags"
brew "vcs"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "joshmedeski/sesh/sesh"
brew "keith/formulae/dyld-shared-cache-extractor"
brew "modularml/packages/modular"
brew "mongodb/brew/mongodb-community"
brew "nativeos/i386-elf-toolchain/i386-elf-binutils"
brew "nativeos/i386-elf-toolchain/i386-elf-gcc"
cask "arm-performance-libraries"
cask "cmake-app"
cask "multipass"
cask "trex"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "github.com/google/pprof"
go "honnef.co/go/tools/cmd/staticcheck"
